src/cf/Catalogs/fmInfoStructures.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmInfoStructures</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StructureType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmInfoStructureTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ViewFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmRoundMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmRoundMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DontOutputRowsOutOfStructure</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetTotalType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetTotalType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/fmBindingInfoStructuresToDepartments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmBindingInfoStructuresToDepartments</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ApplyByDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>InfoStructure</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmInfoStructures</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/fmInfoStructures/Ext/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

Procedure BeforeWrite(Cancel)
	
	// Если элемент справочника пометили на удаление, то удалим все записи с данной структурой сведений из РС "Структуры сведений ввода и вывода данных"
	If Ref.DeletionMark = False AND DeletionMark = True Then 
		
		Query = New Query();
		Query.Text = "SELECT
		|	fmBindingInfoStructuresToDepartments.InfoStructure,
		|	fmBindingInfoStructuresToDepartments.Department
		|FROM
		|	InformationRegister.fmBindingInfoStructuresToDepartments AS fmBindingInfoStructuresToDepartments
		|WHERE
		|	fmBindingInfoStructuresToDepartments.InfoStructure = &InfoStructure";
		
		Query.SetParameter("InfoStructure", Ref);
		
		InfoStructureRegisterForDataInputAndOutput = InformationRegisters.fmBindingInfoStructuresToDepartments;
		
		Selection = Query.Execute().SELECT();
		While Selection.Next() Do
			Record = InfoStructureRegisterForDataInputAndOutput.CreateRecordManager();
			Record.InfoStructure 	= Selection.InfoStructure;
			Record.Department 		= Selection.Department;
			Record.Delete();
		EndDo;
	EndIf;
	
EndProcedure //ПередЗаписью()

#EndIf
